MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_ADSB_1090/FlyRf_Base_26_04_28_15/System.cpp
/*
  Модуль System.cpp
  Назначение:
  - Главный координатор проекта, который собирает все подсистемы в единый цикл.

  Основные задачи модуля:
  - Выполнять последовательную инициализацию модулей при старте.
  - Обслуживать основной loop: GNSS, RF, WEB, дисплей, вывод, мосты и сервисные функции.
  - Поддерживать режимы теста, локальные координаты и общую логику времени/обновления.
*/

#include <Arduino.h>
#include <cstring>
#include <cmath>
#include <TimeLib.h>
#include "System.h"
#include "TrafficDB.h"
#include "ESP32RF.h"
#include "RF.h"
#include "Log.h"
#include "NMEA.h"
#include "RP2040Bridge.h"
#include "ADSBReceiverESP32.h"
#include "EEPROMRF.h"
#include "WiFiRF.h"
#include "WebRF.h"
#include "LANRF.h"
#include "DeviceInfo.h"
#include "OTA.h"
#include "RS485Display.h"
#include "FlyRfSpi.h"
#include "GNSS.h"
#include "Baro.h"
#include "Bluetooth.h"
#include "Tracker.h"
#include "Mavlink.h"

namespace
{
    struct SimTrafficState
    {
        bool active;  // Логический флаг состояния: показывает, разрешена ли операция, активен ли режим или есть ли данные.
        uint32_t addr;  // Параметр конфигурации: хранит выбранный режим, адрес, настройки модуля или пользовательское значение.
        int squawk;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
        char callsign[8];  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
        double latitude;  // Навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта.
        double longitude;  // Навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта.
        int16_t offsetSteps;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
        int8_t direction;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
        uint32_t lastStepMs;  // Временной параметр или отметка времени: используется для тайм-аутов, задержек, мигания или контроля давности данных.
        uint32_t startDelayMs;  // Временной параметр или отметка времени: используется для тайм-аутов, задержек, мигания или контроля давности данных.
    };

    static uint32_t g_lastOwnshipTxMs = 0;  // Логический флаг состояния: показывает, разрешена ли операция, активен ли режим или есть ли данные.
    static uint8_t g_lastModeApplied = 0xFFU;  // Навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта.
    static float g_lastModeBaseLat = 9999.0f;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    static float g_lastModeBaseLon = 9999.0f;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    static int16_t g_testFlightOffsetSteps = 0;  // Логический флаг состояния: показывает, разрешена ли операция, активен ли режим или есть ли данные.
    static int8_t g_testFlightDirection = 1;  // Логический флаг состояния: показывает, разрешена ли операция, активен ли режим или есть ли данные.
    static uint32_t g_lastTestFlightStepMs = 0;  // Логический флаг состояния: показывает, разрешена ли операция, активен ли режим или есть ли данные.
    static SimTrafficState g_simTraffic[5] = {};  // Логический флаг состояния: показывает, разрешена ли операция, активен ли режим или есть ли данные.
    static uint32_t g_testTrafficEpochMs = 0;  // Логический флаг состояния: показывает, разрешена ли операция, активен ли режим или есть ли данные.
    static bool g_simTrafficWasActive = false;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    static uint16_t g_testDisplayCourseDeg = 0U;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    static uint32_t g_lastTestDisplayCourseStepMs = 0U;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.

    constexpr double kEarthRadiusMeters = 6371000.0;  // Навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта.
    constexpr float kTestTrackOwnForwardCourseDeg = 70.0f;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr float kTestTrackStepMeters = 500.0f;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr int16_t kTestTrackLimitSteps = 40;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr float kTestTrackSpeedKnots = ((kTestTrackStepMeters / 1852.0f) * 3600.0f) * 0.5f;
    constexpr uint32_t kMotionStepPeriodMs = 2000UL;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr float kSimTrafficInitialCourseDeg = 40.0f;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr float kSimTrafficCourseStepDeg = 20.0f;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr uint32_t kSimTrafficAsyncDelayMs = 5000UL;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr uint32_t kTestDisplayCourseStepPeriodMs = 3000UL;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr uint16_t kTestDisplayCourseStepDeg = 5U;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr float kSimAltitudeMinMeters = 1000.0f;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr float kSimAltitudeMaxMeters = 8000.0f;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr float kTestOwnshipAltitudeMeters = 3000.0f;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr float kDefaultTestBaseLat = 50.0000f;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr float kDefaultTestBaseLon = 8.0000f;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr uint32_t kSimAltitudeHalfPeriodMs = 700000UL;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr uint32_t kSimAltitudeFullPeriodMs = kSimAltitudeHalfPeriodMs * 2UL;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
    constexpr size_t kSimTrafficCount = sizeof(g_simTraffic) / sizeof(g_simTraffic[0]);
    constexpr size_t kSimAltitudeProfileCount = kSimTrafficCount + 1U;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.

    static const uint32_t kSimTrafficAddresses[kSimTrafficCount] = {
        0x0F1111UL, 0x0F2222UL, 0x0F3333UL, 0x0F4444UL, 0x0F5555UL
    };

    static const int kSimTrafficSquawks[kSimTrafficCount] = {
        1521, 1522, 1523, 1524, 1525
    };

    static const char* const kSimTrafficCallsigns[kSimTrafficCount] = {
        "AFL1111", "AFL2222", "AFL3333", "AFL4444", "AFL5555"
    };

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `deg2rad` и обрабатывает deg2rad в контексте модуля System.cpp.
// Локальные переменные: явные локальные переменные не используются; функция работает через параметры, глобальные структуры и результаты вызовов.
//------------------------------------------------------------------------------
    static double deg2rad(double value)
    {
        return value * 0.017453292519943295769236907684886;
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `rad2deg` и обрабатывает rad2deg в контексте модуля System.cpp.
// Локальные переменные: явные локальные переменные не используются; функция работает через параметры, глобальные структуры и результаты вызовов.
//------------------------------------------------------------------------------
    static double rad2deg(double value)
    {
        return value * 57.295779513082320876798154814105;
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `normalizeCourse360` и обрабатывает course360 в контексте модуля System.cpp.
// Локальные переменные: явные локальные переменные не используются; функция работает через параметры, глобальные структуры и результаты вызовов.
//------------------------------------------------------------------------------
    static float normalizeCourse360(float value)
    {
        while (value >= 360.0f) value -= 360.0f;
        while (value < 0.0f) value += 360.0f;
        return value;
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `advanceDisplayCourseStep` и обрабатывает advance курс step в контексте модуля System.cpp.
// Локальные переменные: явные локальные переменные не используются; функция работает через параметры, глобальные структуры и результаты вызовов.
//------------------------------------------------------------------------------
    static void advanceDisplayCourseStep(uint32_t nowMs)
    {
        while ((uint32_t)(nowMs - g_lastTestDisplayCourseStepMs) >= kTestDisplayCourseStepPeriodMs)
        {
            g_lastTestDisplayCourseStepMs += kTestDisplayCourseStepPeriodMs;
            g_testDisplayCourseDeg = (uint16_t)((g_testDisplayCourseDeg + kTestDisplayCourseStepDeg) % 360U);
        }
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `fillCallsign` и обрабатывает fill callsign в контексте модуля System.cpp.
// Локальные переменные: srcLen — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; copyLen — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта.
//------------------------------------------------------------------------------
    static void fillCallsign(char* dst, size_t dstSize, const char* src)
    {
        if (dst == nullptr || dstSize == 0)
        {
            return;
        }

        memset(dst, ' ', dstSize);
        if (src == nullptr)
        {
            return;
        }

        const size_t srcLen = strlen(src);
        const size_t copyLen = (srcLen < dstSize) ? srcLen : dstSize;
        memcpy(dst, src, copyLen);
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `projectCoordinate` и обрабатывает project coordinate в контексте модуля System.cpp.
// Локальные переменные: angularDistance — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта; bearingRad — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; lat1 — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта; lon1 — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта; sinLat1 — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта; cosLat1 — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта.
//------------------------------------------------------------------------------
    static void projectCoordinate(double startLatDeg, double startLonDeg, float bearingDeg, double distanceMeters,
                                  float& outLatDeg, float& outLonDeg)
    {
        if (distanceMeters == 0.0)
        {
            outLatDeg = (float)startLatDeg;
            outLonDeg = (float)startLonDeg;
            return;
        }

        const double angularDistance = distanceMeters / kEarthRadiusMeters;  // Навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта.
        const double bearingRad = deg2rad((double)bearingDeg);
        const double lat1 = deg2rad(startLatDeg);
        const double lon1 = deg2rad(startLonDeg);
        const double sinLat1 = sin(lat1);
        const double cosLat1 = cos(lat1);
        const double sinAd = sin(angularDistance);
        const double cosAd = cos(angularDistance);

        const double lat2 = asin(sinLat1 * cosAd + cosLat1 * sinAd * cos(bearingRad));
        const double lon2 = lon1 + atan2(sin(bearingRad) * sinAd * cosLat1,
                                         cosAd - sinLat1 * sin(lat2));

