MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_ADSB_1090/FlyRf_Base_26_04_28_15/System.cpp
        outLatDeg = (float)rad2deg(lat2);
        outLonDeg = (float)rad2deg(lon2);

        while (outLonDeg > 180.0f) outLonDeg -= 360.0f;
        while (outLonDeg < -180.0f) outLonDeg += 360.0f;
    }

//------------------------------------------------------------------------------
// Назначение функции: Возвращает system seconds, рассчитанное или считанное по текущему состоянию модуля.
// Локальные переменные: t — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
//------------------------------------------------------------------------------
    static time_t currentSystemSeconds()
    {
        const time_t t = now();
        return (t > 0) ? t : (time_t)(millis() / 1000UL);
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `ownshipHasAnyCoordinates` и обрабатывает ownship any coordinates в контексте модуля System.cpp.
// Локальные переменные: явные локальные переменные не используются; функция работает через параметры, глобальные структуры и результаты вызовов.
//------------------------------------------------------------------------------
    static bool ownshipHasAnyCoordinates()
    {
        return (ThisAircraft.latitude != 0.0f || ThisAircraft.longitude != 0.0f ||
                ThisAircraft.old_latitude != 0.0f || ThisAircraft.old_longitude != 0.0f);
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `resolveTestBaseCoordinates` и обрабатывает resolve test базу coordinates в контексте модуля System.cpp.
// Локальные переменные: явные локальные переменные не используются; функция работает через параметры, глобальные структуры и результаты вызовов.
//------------------------------------------------------------------------------
    static void resolveTestBaseCoordinates(float& baseLat, float& baseLon)
    {
        if (fabsf(baseLat) > 0.00001f || fabsf(baseLon) > 0.00001f)
        {
            return;
        }

        baseLat = kDefaultTestBaseLat;
        baseLon = kDefaultTestBaseLon;
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `refreshOwnshipTimestamp` и обрабатывает refresh ownship timestamp в контексте модуля System.cpp.
// Локальные переменные: явные локальные переменные не используются; функция работает через параметры, глобальные структуры и результаты вызовов.
//------------------------------------------------------------------------------
    static void refreshOwnshipTimestamp()
    {
        ThisAircraft.timestamp = currentSystemSeconds();
    }

//------------------------------------------------------------------------------
// Назначение функции: Применяет ownship identity к рабочему состоянию модуля и синхронизирует связанные параметры.
// Локальные переменные: явные локальные переменные не используются; функция работает через параметры, глобальные структуры и результаты вызовов.
//------------------------------------------------------------------------------
    static void applyOwnshipIdentity(uint8_t mode)
    {
        if (FlyRfMode_usesLocalCoordinates(mode))
        {
            ThisAircraft.squawk = 1110;
            fillCallsign(ThisAircraft.callsign, sizeof(ThisAircraft.callsign), "TEST001");
            ThisAircraft.aircraft_type = AIRCRAFT_TYPE_JET;
        }
        else
        {
            ThisAircraft.squawk = 1111;
            fillCallsign(ThisAircraft.callsign, sizeof(ThisAircraft.callsign), "FlyRF");
            ThisAircraft.aircraft_type = settings ? settings->aircraft_type : AIRCRAFT_TYPE_UNKNOWN;
        }
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `advanceMotionStep` и обрабатывает advance motion step в контексте модуля System.cpp.
// Локальные переменные: changed — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
//------------------------------------------------------------------------------
    static bool advanceMotionStep(uint32_t nowMs, uint32_t& lastStepMs, int16_t& offsetSteps, int8_t& direction)
    {
        bool changed = false;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
        while ((uint32_t)(nowMs - lastStepMs) >= kMotionStepPeriodMs)
        {
            lastStepMs += kMotionStepPeriodMs;
            offsetSteps = (int16_t)(offsetSteps + direction);
            if (offsetSteps >= kTestTrackLimitSteps)
            {
                offsetSteps = kTestTrackLimitSteps;
                direction = -1;
            }
            else if (offsetSteps <= -kTestTrackLimitSteps)
            {
                offsetSteps = -kTestTrackLimitSteps;
                direction = 1;
            }
            changed = true;
        }
        return changed;
    }

//------------------------------------------------------------------------------
// Назначение функции: Вычисляет track position по текущим данным проекта и возвращает готовый результат.
// Локальные переменные: reverseCourseDeg — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта; legBearing — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; distanceMeters — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта.
//------------------------------------------------------------------------------
    static void computeTrackPosition(float baseLat, float baseLon, float forwardCourseDeg,
                                     int16_t offsetSteps, int8_t direction,
                                     float& outLat, float& outLon, float& outCourse, float& outSpeed)
    {
        const float reverseCourseDeg = normalizeCourse360(forwardCourseDeg + 180.0f);
        const float legBearing = (offsetSteps >= 0) ? forwardCourseDeg : reverseCourseDeg;
        const double distanceMeters = fabs((double)offsetSteps) * (double)kTestTrackStepMeters;
        projectCoordinate((double)baseLat, (double)baseLon, legBearing, distanceMeters, outLat, outLon);
        outCourse = (direction >= 0) ? forwardCourseDeg : reverseCourseDeg;
        outSpeed = kTestTrackSpeedKnots;
    }

//------------------------------------------------------------------------------
// Назначение функции: Вычисляет simulated altitude по текущим данным проекта и возвращает готовый результат.
// Локальные переменные: altitudeRange — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта; normalizedProfile — параметр радиоканала или протокола: описывает частоту, мощность, профиль, режим передачи или текущее состояние rf; uint32_t — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; climbing — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; verticalSpeedMps — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; signedVerticalSpeedMps — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
//------------------------------------------------------------------------------
    static void computeSimulatedAltitude(uint32_t nowMs, size_t profileIndex,
                                         float& outAltitude, float& outPressureAltitude,
                                         int& outVertRate, float& outVs)
    {
        const float altitudeRange = kSimAltitudeMaxMeters - kSimAltitudeMinMeters;  // Навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта.
        if (altitudeRange <= 0.0f || kSimAltitudeHalfPeriodMs == 0UL || kSimAltitudeFullPeriodMs == 0UL)
        {
            outAltitude = kSimAltitudeMinMeters;
            outPressureAltitude = kSimAltitudeMinMeters;
            outVertRate = 0;
            outVs = 0.0f;
            return;
        }

