MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_ADSB_1090/FlyRf_Base_26_04_28_15/System.cpp
        const size_t normalizedProfile = (kSimAltitudeProfileCount > 0U) ? (profileIndex % kSimAltitudeProfileCount) : 0U;
        const uint32_t phaseMs = (uint32_t)(((uint64_t)normalizedProfile * (uint64_t)kSimAltitudeFullPeriodMs) /
                                            (uint64_t)kSimAltitudeProfileCount);
        const uint32_t cycleMs = (nowMs + phaseMs) % kSimAltitudeFullPeriodMs;
        const bool climbing = cycleMs < kSimAltitudeHalfPeriodMs;  // Временной параметр или отметка времени: используется для тайм-аутов, задержек, мигания или контроля давности данных.
        const float fraction = climbing ? ((float)cycleMs / (float)kSimAltitudeHalfPeriodMs)
                                        : ((float)(cycleMs - kSimAltitudeHalfPeriodMs) / (float)kSimAltitudeHalfPeriodMs);

        outAltitude = climbing ? (kSimAltitudeMinMeters + altitudeRange * fraction)
                               : (kSimAltitudeMaxMeters - altitudeRange * fraction);
        outPressureAltitude = outAltitude;

        const float verticalSpeedMps = altitudeRange / ((float)kSimAltitudeHalfPeriodMs / 1000.0f);
        const float signedVerticalSpeedMps = climbing ? verticalSpeedMps : -verticalSpeedMps;  // Рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
        outVs = signedVerticalSpeedMps * (_GPS_FEET_PER_METER * 60.0f);
        outVertRate = (int)lroundf(outVs);
    }

//------------------------------------------------------------------------------
// Назначение функции: Очищает simulated запись о цели entries, сбрасывает связанные флаги и возвращает модуль в исходное состояние для этого участка логики.
// Локальные переменные: явные локальные переменные не используются; функция работает через параметры, глобальные структуры и результаты вызовов.
//------------------------------------------------------------------------------
    static void clearSimulatedTrafficEntries()
    {
        for (size_t i = 0; i < kSimTrafficCount; ++i)
        {
            for (int j = 0; j < MAX_TRACKING_OBJECTS; ++j)
            {
                if (Container[j].addr == kSimTrafficAddresses[i])
                {
                    Container[j] = EmptyFO;
                }
            }
        }
    }

//------------------------------------------------------------------------------
// Назначение функции: Очищает test flight состояние, сбрасывает связанные флаги и возвращает модуль в исходное состояние для этого участка логики.
// Локальные переменные: явные локальные переменные не используются; функция работает через параметры, глобальные структуры и результаты вызовов.
//------------------------------------------------------------------------------
    static void resetTestFlightState(float baseLat, float baseLon, uint8_t mode)
    {
        g_lastModeApplied = mode;
        g_lastModeBaseLat = baseLat;
        g_lastModeBaseLon = baseLon;
        g_testFlightOffsetSteps = 0;
        g_testFlightDirection = 1;
        g_lastTestFlightStepMs = millis();
        g_testTrafficEpochMs = g_lastTestFlightStepMs;
        g_testDisplayCourseDeg = 0U;
        g_lastTestDisplayCourseStepMs = g_lastTestFlightStepMs;
        clearSimulatedTrafficEntries();

        for (size_t i = 0; i < kSimTrafficCount; ++i)
        {
            g_simTraffic[i].active = false;
            g_simTraffic[i].addr = kSimTrafficAddresses[i];
            g_simTraffic[i].squawk = kSimTrafficSquawks[i];
            fillCallsign(g_simTraffic[i].callsign, sizeof(g_simTraffic[i].callsign), kSimTrafficCallsigns[i]);
            g_simTraffic[i].latitude = baseLat;
            g_simTraffic[i].longitude = baseLon;
            g_simTraffic[i].offsetSteps = 1;
            g_simTraffic[i].direction = 1;
            g_simTraffic[i].lastStepMs = g_testTrafficEpochMs;
            g_simTraffic[i].startDelayMs = (mode == FLYRF_MODE_TXRX_TEST4) ? (uint32_t)(i * kSimTrafficAsyncDelayMs) : 0UL;
        }
    }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `serviceSimulatedTraffic` и обрабатывает service simulated запись о цели в контексте модуля System.cpp.
// Локальные переменные: simulatedTrafficMode — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта; uint32_t — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; nowTs — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
//------------------------------------------------------------------------------
    static void serviceSimulatedTraffic(float baseLat, float baseLon, uint8_t mode)
    {
        const bool simulatedTrafficMode = (mode == FLYRF_MODE_TXRX_TEST3 || mode == FLYRF_MODE_TXRX_TEST4);
        if (!simulatedTrafficMode)
        {
            if (g_simTrafficWasActive)
            {
                clearSimulatedTrafficEntries();
                g_simTrafficWasActive = false;
            }
            return;
        }

        g_simTrafficWasActive = true;
        const uint32_t nowMs = millis();
        const time_t nowTs = (time_t)(nowMs / 1000UL);

        for (size_t i = 0; i < kSimTrafficCount; ++i)
        {
            SimTrafficState& state = g_simTraffic[i];
            if ((uint32_t)(nowMs - g_testTrafficEpochMs) < state.startDelayMs)
            {
                continue;
            }

            if (!state.active)
            {
                state.active = true;
                state.lastStepMs = g_testTrafficEpochMs + state.startDelayMs;
                state.offsetSteps = 1;
                state.direction = 1;
            }

            advanceMotionStep(nowMs, state.lastStepMs, state.offsetSteps, state.direction);

            float lat = baseLat;
            float lon = baseLon;
            float course = 0.0f;
            float speed = 0.0f;
            float altitude = kSimAltitudeMinMeters;
            float pressureAltitude = kSimAltitudeMinMeters;
            float vs = 0.0f;
            int vertRate = 0;
            const float forwardCourse = normalizeCourse360(kSimTrafficInitialCourseDeg + (float)i * kSimTrafficCourseStepDeg);
            computeTrackPosition(baseLat, baseLon, forwardCourse,
                                 state.offsetSteps, state.direction,
                                 lat, lon, course, speed);
            computeSimulatedAltitude(nowMs, i + 1U, altitude, pressureAltitude, vertRate, vs);
            state.latitude = lat;
            state.longitude = lon;

            ufo_t traffic = EmptyFO;
            traffic.addr = state.addr & 0x00FFFFFFUL;
            traffic.protocol = settings ? settings->rf_protocol : 0U;
            traffic.addr_type = ADDR_TYPE_ICAO;
            traffic.latitude = lat;
            traffic.longitude = lon;
            traffic.altitude = altitude;
            traffic.pressure_altitude = pressureAltitude;
            traffic.course = course;
            traffic.speed = speed;
            traffic.aircraft_type = AIRCRAFT_TYPE_JET;
            traffic.squawk = state.squawk;
            memcpy(traffic.callsign, state.callsign, sizeof(traffic.callsign));
            traffic.vert_rate = vertRate;
            traffic.vs = vs;
            traffic.timestamp = nowTs;
            traffic.timemsg = nowTs;
            traffic.seen = nowTs;
            traffic.rssi_LoRa = 0;
            traffic.rssi = 0;
            traffic.snr = 0.0f;
            traffic.signal_source = TRAFFIC_SOURCE_FLARM_LORA;
            traffic.source = TRAFFIC_SOURCE_FLARM_LORA;
            traffic.valid = true;

            Traffic_Update(&traffic);
            Traffic_Add(&traffic);
        }
    }

//------------------------------------------------------------------------------
// Назначение функции: Вычисляет local coordinate режим по текущим данным проекта и возвращает готовый результат.
// Локальные переменные: uint8_t — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; baseLat — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта; baseLon — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта; outLat — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта; outLon — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта; outCourse — навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта.
//------------------------------------------------------------------------------
    static void applyLocalCoordinateMode()
    {
        if (settings == nullptr)
        {
            return;
        }

        const uint8_t mode = settings->mode;  // Параметр конфигурации: хранит выбранный режим, адрес, настройки модуля или пользовательское значение.
        float baseLat = settings->local_latitude;  // Навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта.
        float baseLon = settings->local_longitude;  // Навигационный или геометрический параметр: координаты, угол, дальность, размер или положение объекта.
        resolveTestBaseCoordinates(baseLat, baseLon);
        const bool needReset = (mode != g_lastModeApplied) ||
                               (fabsf(baseLat - g_lastModeBaseLat) > 0.000001f) ||
                               (fabsf(baseLon - g_lastModeBaseLon) > 0.000001f);
        if (needReset)
        {
            resetTestFlightState(baseLat, baseLon, mode);
        }

