MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_ADSB_1090/FlyRf_Base_26_04_28_15/System.cpp
    GNSS_setup();
    Serial.println(F("[SETUP] GNSS setup done"));

    Baro_setup();
    Serial.println(F("[SETUP] Baro setup done"));

    Display_setup();
    Serial.println(F("[SETUP] Display ready"));

    const byte rfType = RF_setup();
    if (rfType != RF_IC_NONE)
    {
        Serial.println(F("[SETUP] LoRa setup done"));
    }
    else
    {
        Serial.println(F("[SETUP] LoRa module not detected"));
    }

    RP2040Bridge_setup();
    RP2040BridgeDiag rp2040Diag = {};
    if (RP2040Bridge_getDiag(rp2040Diag))
    {
        Serial.println(F("[SETUP] RP2040 setup done"));
    }
    else
    {
        Serial.println(F("[SETUP] RP2040 setup skipped"));
    }

    ADSBReceiverESP32_setup();
    Serial.println(F("[SETUP] ESP32 ADS-B setup done"));

    WiFi_setup();
    Serial.println(F("[SETUP] WiFi setup done"));

    Web_setup();
    Serial.println(F("[SETUP] Web setup done"));

    LAN_setup();
    Serial.println(F("[SETUP] LAN setup done"));

    Bluetooth_setup();
    Serial.println(F("[SETUP] Bluetooth setup done"));

    RS485Display_setup();
    Serial.println(F("[SETUP] RS485 setup done"));

    NMEA_setup();
    Serial.println(F("[SETUP] NMEA setup done"));

    Tracker_setup();
    Serial.println(F("[SETUP] Tracker setup done"));

    Mavlink_setup();
    Serial.println(F("[SETUP] MAVLink setup done"));

    OTA_setup();
    Serial.println(F("[SETUP] OTA setup done"));

    Serial.println(F("Setup End"));
}

//------------------------------------------------------------------------------
// Назначение функции: Обслуживает system в основном цикле: проверяет события, обновляет состояние и запускает нужные действия.
// Локальные переменные: uint32_t — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
//------------------------------------------------------------------------------
void SystemLoop()
{
    static uint32_t lastDisplayLoopMs = 0;  // Временной параметр или отметка времени: используется для тайм-аутов, задержек, мигания или контроля давности данных.

    GNSS_loop();
    Baro_loop();
    if (settings != nullptr && FlyRfMode_usesLocalCoordinates(settings->mode))
    {
        applyLocalCoordinateMode();
    }
    else
    {
        g_lastModeApplied = 0xFFU;
        applyOwnshipIdentity(FLYRF_MODE_NORMAL);
        serviceSimulatedTraffic(settings ? settings->local_latitude : 0.0f,
                                settings ? settings->local_longitude : 0.0f,
                                FLYRF_MODE_NORMAL);
    }
    serviceOwnshipTransmit();
    TrafficDB.removeStale();
    RF_loop();
    ParseData();
    RP2040Bridge_loop();
    ADSBReceiverESP32_loop();
    WiFi_loop();
    Web_loop();
    LAN_loop();
    Tracker_loop();
    Mavlink_loop();
    RS485Display_loop();
    NMEA_loop();
    Bluetooth_loop();
    OTA_loop();

    const uint32_t nowMs = millis();
    if ((uint32_t)(nowMs - lastDisplayLoopMs) >= 300UL)
    {
        lastDisplayLoopMs = nowMs;
        Display_loop();
    }

    delay(1);
}
